//=============================================================================
//
// ゲームシステム処理 [check_game.cpp]
//
//=============================================================================
#include "main.h"
#include "renderer.h"
#include "game.h"
#include "player.h"
#include "enemy.h"
#include "light.h"
#include "collision.h"
#include "life.h"
#include "check_game.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define INV_TIME	(180)		//無敵フレーム数

//*****************************************************************************
// グローバル変数
//*****************************************************************************
static int playerInv = 0;	//プレイヤー無敵時間

//*****************************************************************************
// 更新処理
//*****************************************************************************
void CheckGame(void)
{
	//CheckLightOn();
	if (playerInv > 0)playerInv--;
	CheckPECollision();
}

//*****************************************************************************
// 描画処理
//*****************************************************************************

//*****************************************************************************
// 更新内部処理
//*****************************************************************************
void CheckPECollision(void)
{
	PLAYER *player = GetPlayer();
	ENEMY *enemy = GetEnemy();
	for (int i = 0; i < MAX_ENEMY; i++)
	{
		if (enemy[i].use != TRUE || playerInv > 0)continue;		//エネミーが使われていないか無敵時間中ならスルー
		if (CollisionBC(player->pos, enemy[i].pos, player->size, enemy[i].fWidth))
		{
			AddLife(-5, PLAYER_LIFE, 0);	//ライフダメージ
			AddSanity(-5, PLAYER_LIFE, 0);	//正気度ダメージ
			playerInv = INV_TIME;			//当たったら無敵時間を追加
		}
	}

}