//=============================================================================
//
// ゲームオーバー画面処理 [game_over.h]
// Author : 
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
enum TEXTURE_GAME_OVER
{
	GAME_OVER_BG,
	GAME_OVER_TEXT,
	GAME_OVER_ENEMY
};

enum EVENT_PART
{
	Start_BGM,
	Enemy_Dash,
	Dead,
	MAX_EVENT
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitGame_over(void);
void UninitGame_over(void);
void UpdateGame_over(void);
void DrawGame_over(void);
void SetGameOver(void);