#pragma once
//=============================================================================
//
// 文字テクスチャ等の表示処理 [tutorial_text.h]
// Author : 
//
//=============================================================================
#pragma once

//*****************************************************************************
// マクロ定義
//*****************************************************************************
enum TUTORIAL_TEXT_NUM
{
	TUTORIAL_LIGHTER,
	TUTORIAL_MATCHI,
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTutorialTex(void);
void UninitTutorialTex(void);
void UpdateTutorialTex(void);
void DrawTutorialTex(void);
void SetTutorialTexture(int i);
BOOL GetTutorialTex(void);